DataProcessors/LN_МСРИнструментПользовательские.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>LN_МСРИнструментПользовательские</Name>
			<Comment>Контейнер MCP tools, читающихся из Справочника.LN_МСРПользовательскиеИнструменты в runtime. Регистрирует все Активен=Истина в tools/list, плюс служебные tools register_tool/update_tool/delete_tool/list_custom_tools.</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/LN_МСРПользовательскиеИнструменты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>LN_МСРПользовательскиеИнструменты</Name>
			<Comment>Справочник динамических MCP tools. Каждый активный элемент попадает в tools/list. Код выполняется в контейнере LN_МСРИнструментПользовательские.</Comment>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяТула</Name>
					<Comment>То, что MCP-клиент видит как поле name. Только латиница, цифры, underscore.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеТула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаПараметров</Name>
					<Comment>Полная JSON-схема в формате MCP, например {"type":"object","properties":{...},"required":[...]}.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодBSL</Name>
					<Comment>В коде доступны: Аргументы (Структура аргументов вызова), Результат (Произвольный, читается обратно). Пример: Результат = Аргументы.x + Аргументы.y;</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезопасныйРежим</Name>
					<Comment>Если истина — перед Выполнить() вызывается УстановитьБезопасныйРежим(Истина).</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторСоздания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/LN_МСРИнструментПользовательские/Ext/ManagerModule.bsl
//LN++ ManagerModule контейнера LN_МСРИнструментПользовательские
// Tools-as-data: каждый Активен=Истина элемент Справочника.LN_МСРПользовательскиеИнструменты
// регистрируется в tools/list под своим ИмяТула. При вызове tools/call с этим именем
// контейнер находит элемент, читает его КодBSL и выполняет через Выполнить(КодBSL),
// предоставляя переменные Аргументы (Структура) и Результат (Произвольный).
//
// Служебные tools контейнера:
//   register_tool       — создать новый tool в справочнике
//   update_tool         — обновить существующий
//   delete_tool         — удалить (физически)
//   list_custom_tools   — список зарегистрированных пользовательских tools
//

#Область ПрограммныйИнтерфейс

Процедура ДобавитьИнструменты(Инструменты) Экспорт

	ДобавитьСлужебныеТулы(Инструменты);
	ДобавитьПользовательскиеТулы(Инструменты);

КонецПроцедуры

Функция ВыполнитьИнструмент(ИмяИнструмента, Аргументы) Экспорт

	Если ИмяИнструмента = "register_tool" Тогда
		Возврат ВыполнитьRegisterTool(Аргументы);
	ИначеЕсли ИмяИнструмента = "update_tool" Тогда
		Возврат ВыполнитьUpdateTool(Аргументы);
	ИначеЕсли ИмяИнструмента = "delete_tool" Тогда
		Возврат ВыполнитьDeleteTool(Аргументы);
	ИначеЕсли ИмяИнструмента = "list_custom_tools" Тогда
		Возврат ВыполнитьListCustomTools(Аргументы);
	КонецЕсли;

	Возврат ВыполнитьПользовательский(ИмяИнструмента, Аргументы);

КонецФункции

#КонецОбласти

#Область СлужебныеТулы

Процедура ДобавитьСлужебныеТулы(Инструменты)

	// register_tool
	Параметры = Новый Массив;
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("name", "string", "Имя tool (уникальное, латиница/цифры/_)", , Истина));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("description", "string", "Описание tool для LLM", , Истина));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("input_schema", "string",
		"JSON-схема параметров (object). Если пусто — будет создана схема без свойств.", , Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("code", "string",
		"Код BSL — тело Выполнить(). Доступны: Аргументы (Структура), Результат (Произвольный, читается обратно).",
		, Истина));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("safe_mode", "boolean",
		"true — перед Выполнить() вызывается УстановитьБезопасныйРежим(Истина). По умолчанию false.", Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("active", "boolean",
		"true (по умолчанию) — tool сразу попадёт в tools/list.", Истина));
	mcp_Метаданные.ДобавитьИнструмент(Инструменты, "register_tool",
		"Регистрирует новый MCP tool как запись Справочника.LN_МСРПользовательскиеИнструменты."
			+ " Tool сразу же становится виден в tools/list (без перезапуска).",
		mcp_Метаданные.СхемаПараметровИнструмента(Параметры));

	// update_tool
	Параметры = Новый Массив;
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("name", "string", "Имя tool", , Истина));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("description", "string", "Новое описание", , Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("input_schema", "string", "Новая JSON-схема", , Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("code", "string", "Новый код BSL", , Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("safe_mode", "boolean", "Новый safe_mode", , Ложь));
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("active", "boolean", "Новый active", , Ложь));
	mcp_Метаданные.ДобавитьИнструмент(Инструменты, "update_tool",
		"Обновляет поля существующего пользовательского tool. Передавайте только те поля, что нужно изменить.",
		mcp_Метаданные.СхемаПараметровИнструмента(Параметры));

	// delete_tool
	Параметры = Новый Массив;
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("name", "string", "Имя tool", , Истина));
	mcp_Метаданные.ДобавитьИнструмент(Инструменты, "delete_tool",
		"Физически удаляет пользовательский tool из справочника.",
		mcp_Метаданные.СхемаПараметровИнструмента(Параметры));

	// list_custom_tools
	Параметры = Новый Массив;
	Параметры.Добавить(mcp_Метаданные.ПараметрИнструмента("only_active", "boolean",
		"true (по умолчанию) — только Активен=Истина. false — все.", Истина));
	mcp_Метаданные.ДобавитьИнструмент(Инструменты, "list_custom_tools",
		"Возвращает массив зарегистрированных пользовательских tools со всеми полями (имя, описание, схема, код, активность).",
		mcp_Метаданные.СхемаПараметровИнструмента(Параметры));

КонецПроцедуры

#КонецОбласти

#Область Пользовательские

Процедура ДобавитьПользовательскиеТулы(Инструменты)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнструментыСпр.ИмяТула КАК ИмяТула,
	|	ИнструментыСпр.ОписаниеТула КАК ОписаниеТула,
	|	ИнструментыСпр.СхемаПараметров КАК СхемаПараметров
	|ИЗ
	|	Справочник.LN_МСРПользовательскиеИнструменты КАК ИнструментыСпр
	|ГДЕ
	|	ИнструментыСпр.Активен
	|	И НЕ ИнструментыСпр.ПометкаУдаления
	|	И ИнструментыСпр.ИмяТула <> """"";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Имя = СокрЛП(Выборка.ИмяТула);
		Если Не ПравильноеИмяТула(Имя) Тогда
			Продолжить;
		КонецЕсли;
		Если ИмяВКонфликте(Инструменты, Имя) Тогда
			// Системный tool имеет приоритет, пользовательский пропускаем
			Продолжить;
		КонецЕсли;
		Схема = ?(ЗначениеЗаполнено(Выборка.СхемаПараметров),
			Выборка.СхемаПараметров,
			"{""type"":""object"",""properties"":{}}");
		mcp_Метаданные.ДобавитьИнструмент(Инструменты, Имя, Выборка.ОписаниеТула, Схема);
	КонецЦикла;

КонецПроцедуры

Функция ВыполнитьПользовательский(ИмяИнструмента, Аргументы)

	Если Не ПравильноеИмяТула(ИмяИнструмента) Тогда
		ВызватьИсключение СтрШаблон("Недопустимое имя tool: %1", ИмяИнструмента);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИнструментыСпр.КодBSL КАК КодBSL,
	|	ИнструментыСпр.БезопасныйРежим КАК БезопасныйРежим,
	|	ИнструментыСпр.Активен КАК Активен
	|ИЗ
	|	Справочник.LN_МСРПользовательскиеИнструменты КАК ИнструментыСпр
	|ГДЕ
	|	ИнструментыСпр.ИмяТула = &Имя
	|	И НЕ ИнструментыСпр.ПометкаУдаления";
	Запрос.УстановитьПараметр("Имя", СокрЛП(ИмяИнструмента));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение СтрШаблон("Пользовательский tool '%1' не найден", ИмяИнструмента);
	КонецЕсли;
	Если Не Выборка.Активен Тогда
		ВызватьИсключение СтрШаблон("Пользовательский tool '%1' помечен Неактивен", ИмяИнструмента);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Выборка.КодBSL) Тогда
		ВызватьИсключение СтрШаблон("У tool '%1' пустой КодBSL", ИмяИнструмента);
	КонецЕсли;

	Результат = Неопределено;
	Если Выборка.БезопасныйРежим Тогда
		УстановитьБезопасныйРежим(Истина);
	КонецЕсли;
	Попытка
		Выполнить(Выборка.КодBSL);
	Исключение
		ВызватьИсключение СтрШаблон("Ошибка пользовательского tool '%1': %2",
			ИмяИнструмента, ОписаниеОшибки());
	КонецПопытки;
	Возврат LN_МСРКодирование.БезопасноеЗначение(Результат);

КонецФункции

#КонецОбласти

#Область CRUD

Функция ВыполнитьRegisterTool(Аргументы)

	Имя = ?(Аргументы.Свойство("name"), СокрЛП(Строка(Аргументы.name)), "");
	Если Не ПравильноеИмяТула(Имя) Тогда
		ВызватьИсключение "Недопустимое имя tool (разрешены: латиница, цифры, '_', длина 1-100)";
	КонецЕсли;
	ПроверитьИмяНеЗанято(Имя);

	Описание = ?(Аргументы.Свойство("description"), Строка(Аргументы.description), "");
	Если Не ЗначениеЗаполнено(Описание) Тогда
		ВызватьИсключение "description обязателен";
	КонецЕсли;
	Код = ?(Аргументы.Свойство("code"), Строка(Аргументы.code), "");
	Если Не ЗначениеЗаполнено(Код) Тогда
		ВызватьИсключение "code обязателен";
	КонецЕсли;
	Схема = ?(Аргументы.Свойство("input_schema"), Строка(Аргументы.input_schema), "");
	БезопасныйРежим = ?(Аргументы.Свойство("safe_mode"), Аргументы.safe_mode = Истина, Ложь);
	Активен = ?(Аргументы.Свойство("active"), Аргументы.active <> Ложь, Истина);

	Объект = Справочники.LN_МСРПользовательскиеИнструменты.СоздатьЭлемент();
	Объект.Наименование = Лев(Имя, 100);
	Объект.ИмяТула = Имя;
	Объект.ОписаниеТула = Описание;
	Объект.СхемаПараметров = Схема;
	Объект.КодBSL = Код;
	Объект.БезопасныйРежим = БезопасныйРежим;
	Объект.Активен = Активен;
	Объект.АвторСоздания = ИмяТекущегоПользователя();
	Объект.Записать();

	mcp_КонтейнерыПовтИсп.СброситьКэш();

	Возврат Новый Структура("created, name, ref",
		Истина, Имя, Строка(Объект.Ссылка.УникальныйИдентификатор()));

КонецФункции

Функция ВыполнитьUpdateTool(Аргументы)

	Имя = ?(Аргументы.Свойство("name"), СокрЛП(Строка(Аргументы.name)), "");
	Если Не ЗначениеЗаполнено(Имя) Тогда
		ВызватьИсключение "name обязателен";
	КонецЕсли;
	Ссылка = НайтиПоИмени(Имя);
	Если Ссылка = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Tool '%1' не найден", Имя);
	КонецЕсли;
	Объект = Ссылка.ПолучитьОбъект();
	Изменения = Новый Массив;
	Если Аргументы.Свойство("description") Тогда
		Объект.ОписаниеТула = Строка(Аргументы.description); Изменения.Добавить("description");
	КонецЕсли;
	Если Аргументы.Свойство("input_schema") Тогда
		Объект.СхемаПараметров = Строка(Аргументы.input_schema); Изменения.Добавить("input_schema");
	КонецЕсли;
	Если Аргументы.Свойство("code") Тогда
		Объект.КодBSL = Строка(Аргументы.code); Изменения.Добавить("code");
	КонецЕсли;
	Если Аргументы.Свойство("safe_mode") Тогда
		Объект.БезопасныйРежим = (Аргументы.safe_mode = Истина); Изменения.Добавить("safe_mode");
	КонецЕсли;
	Если Аргументы.Свойство("active") Тогда
		Объект.Активен = (Аргументы.active <> Ложь); Изменения.Добавить("active");
	КонецЕсли;
	Объект.Записать();
	mcp_КонтейнерыПовтИсп.СброситьКэш();
	Возврат Новый Структура("updated, name, changed_fields",
		Истина, Имя, Изменения);

КонецФункции

Функция ВыполнитьDeleteTool(Аргументы)

	Имя = ?(Аргументы.Свойство("name"), СокрЛП(Строка(Аргументы.name)), "");
	Если Не ЗначениеЗаполнено(Имя) Тогда
		ВызватьИсключение "name обязателен";
	КонецЕсли;
	Ссылка = НайтиПоИмени(Имя);
	Если Ссылка = Неопределено Тогда
		Возврат Новый Структура("deleted, name", Ложь, Имя);
	КонецЕсли;
	Объект = Ссылка.ПолучитьОбъект();
	Объект.Удалить();
	mcp_КонтейнерыПовтИсп.СброситьКэш();
	Возврат Новый Структура("deleted, name", Истина, Имя);

КонецФункции

Функция ВыполнитьListCustomTools(Аргументы)

	ТолькоАктивные = ?(Аргументы.Свойство("only_active"), Аргументы.only_active <> Ложь, Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнструментыСпр.ИмяТула КАК name,
	|	ИнструментыСпр.ОписаниеТула КАК description,
	|	ИнструментыСпр.СхемаПараметров КАК input_schema,
	|	ИнструментыСпр.КодBSL КАК code,
	|	ИнструментыСпр.БезопасныйРежим КАК safe_mode,
	|	ИнструментыСпр.Активен КАК active,
	|	ИнструментыСпр.АвторСоздания КАК author
	|ИЗ
	|	Справочник.LN_МСРПользовательскиеИнструменты КАК ИнструментыСпр
	|ГДЕ
	|	НЕ ИнструментыСпр.ПометкаУдаления
	|	И (НЕ &ТолькоАктивные ИЛИ ИнструментыСпр.Активен)
	|УПОРЯДОЧИТЬ ПО
	|	ИнструментыСпр.ИмяТула";
	Запрос.УстановитьПараметр("ТолькоАктивные", ТолькоАктивные);

	Выборка = Запрос.Выполнить().Выбрать();
	Список = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Стр = Новый Структура;
		Стр.Вставить("name", Выборка.name);
		Стр.Вставить("description", Выборка.description);
		Стр.Вставить("input_schema", Выборка.input_schema);
		Стр.Вставить("code", Выборка.code);
		Стр.Вставить("safe_mode", Выборка.safe_mode);
		Стр.Вставить("active", Выборка.active);
		Стр.Вставить("author", Выборка.author);
		Список.Добавить(Стр);
	КонецЦикла;
	Возврат Новый Структура("count, tools", Список.Количество(), Список);

КонецФункции

#КонецОбласти

#Область СлужебноеЛокальное

Функция ПравильноеИмяТула(Имя)
	Если Не ЗначениеЗаполнено(Имя) Или СтрДлина(Имя) > 100 Тогда
		Возврат Ложь;
	КонецЕсли;
	Допустимые = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789_";
	Для Поз = 1 По СтрДлина(Имя) Цикл
		Если СтрНайти(Допустимые, Сред(Имя, Поз, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

Функция ИмяВКонфликте(Инструменты, Имя)
	Для Каждого Стр Из Инструменты Цикл
		Если СокрЛП(Стр.Имя) = Имя Тогда Возврат Истина; КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Функция НайтиПоИмени(Имя)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1 ИнструментыСпр.Ссылка КАК Ссылка
	|ИЗ Справочник.LN_МСРПользовательскиеИнструменты КАК ИнструментыСпр
	|ГДЕ ИнструментыСпр.ИмяТула = &Имя И НЕ ИнструментыСпр.ПометкаУдаления";
	Запрос.УстановитьПараметр("Имя", Имя);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда Возврат Выборка.Ссылка; КонецЕсли;
	Возврат Неопределено;
КонецФункции

Процедура ПроверитьИмяНеЗанято(Имя)
	// Системные tools
	СистемныеИмена = ТаблицаСистемныхИмен();
	Если СистемныеИмена.Найти(Имя) <> Неопределено Тогда
		ВызватьИсключение СтрШаблон("Имя '%1' конфликтует с системным tool", Имя);
	КонецЕсли;
	Если НайтиПоИмени(Имя) <> Неопределено Тогда
		ВызватьИсключение СтрШаблон("Tool с именем '%1' уже существует — используйте update_tool", Имя);
	КонецЕсли;
КонецПроцедуры

Функция ТаблицаСистемныхИмен()
	Имена = Новый Массив;
	Имена.Добавить("execute_query");      Имена.Добавить("execute_code");
	Имена.Добавить("execute_dcs");        Имена.Добавить("validate_query");
	Имена.Добавить("get_metadata");       Имена.Добавить("get_configuration");
	Имена.Добавить("describe_form");      Имена.Добавить("list_extensions");
	Имена.Добавить("get_bsl_syntax_help");Имена.Добавить("get_object_by_link");
	Имена.Добавить("get_link_of_object"); Имена.Добавить("find_references_to_object");
	Имена.Добавить("get_event_log");      Имена.Добавить("get_last_error");
	Имена.Добавить("get_access_rights");  Имена.Добавить("get_setting");
	Имена.Добавить("set_setting");        Имена.Добавить("read_form_xml");
	Имена.Добавить("register_tool");      Имена.Добавить("update_tool");
	Имена.Добавить("delete_tool");        Имена.Добавить("list_custom_tools");
	Имена.Добавить("request_sampling");   Имена.Добавить("pull_pending_sampling");
	Имена.Добавить("submit_sampling_result"); Имена.Добавить("get_sampling_result");
	Возврат Имена;
КонецФункции

Функция ИмяТекущегоПользователя()
	Попытка
		Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	Исключение
		Возврат "";
	КонецПопытки;
КонецФункции

#КонецОбласти
